<template>
  <v-container>
    <v-col cols="6" offset="3">
      <h1 class="text-center" style="font-size: 24px">KingsOfTheSea</h1>
      <v-divider></v-divider>
      <h2>Доброго дня! Ласкаво просимо на нашу сторінку Морського бою! Гра, в якій ви зможете показати свої навички
        стратегії та тактики. У нашій грі є ело рейтинг, який дає змогу змагатися з іншими гравцями та рости у рейтингу
        з кожною перемогою.

        Гра відбувається на полі 10х10 із 10 кораблями. У вас є можливість самостійно розставити кораблі на полі, або
        скористатися режимом рандомної розстановки. Ви зможете зіграти проти інших гравців, або проти комп'ютера.</h2>

      <br>

      <h1 class="text-center" style="font-size: 20px">
        Форма реєстрації / входу
      </h1>
      <v-divider></v-divider>
      <h2>
        Перш ніж почати гру, вам необхідно зареєструватися або увійти у свій обліковий запис. Для цього використовуйте
        форму реєстрації / входу на сторінці.
      </h2>

      <br>

      <h1 class="text-center" style="font-size: 20px">
        Кнопки "Грати" та "Рандомна розстановка"
      </h1>
      <v-divider></v-divider>
      <h2>
        Після входу в систему користувач може обрати одну з двох кнопок: "Грати" або "Рандомна розстановка". Перша
        кнопка дозволяє самостійно розставити кораблі на полі та почати гру з іншим гравцем або з комп'ютером. Друга
        кнопка автоматично розставляє кораблі на полі та запускає гру з випадковим супротивником.
      </h2>

      <br>

      <h1 class="text-center" style="font-size: 20px">
        Рейтинг
      </h1>
      <v-divider></v-divider>
      <h2>
        У нас є система ело рейтингу, яка дає можливість кожному гравцю отримати певний рейтинг після кожної гри. Цей
        рейтинг залежить від вашого рівня гри та результатів битви. Граючи з більш досвідченими гравцями, ви зможете
        отримувати більше очок і підвищувати свій рейтинг.
      </h2>

      <br>

      <h1 class="text-center" style="font-size: 20px">
        Правила гри
      </h1>
      <v-divider></v-divider>
      <h2>
        Гра морський бій відбувається на полі 10х10 клітинок, де кожна клітинка позначена буквою та цифрою (наприклад,
        A1, B2, C3 і т.д.). Гравці розміщують свої кораблі на полі, затем вони по черзі стріляють по клітинках на полі
        противника, намагаючись потопити його кораблі. Гравець, який потопив всі кораблі противника, перемагає.
      </h2>
    </v-col>

  </v-container>


</template>
